　　　UWSC Free版　Ver4.6c                        2011/01/22

[機能]
　マウス・キーボード入力をスクリプト形式で記録、再生
　スクリプト言語によるアプリの操作（COMオブジェクト、DLL利用も可）

=======================================================================
[インストール]
　解凍して出来たファイルを適当なディレクトリに

[アンインストール]
　そのまま削除して下さい

[動作]
　Windows 98/Me/2000/XP/Vista/Windows 7

=======================================================================
[Ver4.6c]
　複数起動した時に停止キー(ALF+F2)が一つにしか効かなかったのを修正
　Operaブラウザに対しACCにて操作ができなくなっていたのを修正
　スケジュール設定にて120秒以上のスクリプトを実行すると次の１分先のチェックがスキップされるのを修正
　BETWEENSTR関数にて前後の指定文字を省略可にした
　TRIM関数にて全角スペースも除去できるようにした
　管理者モード時に一般権限からのファイルのドラッグ&ドロップもできるようにした
　GETID(GET_SCHEDULE_WIN)にてスケジュール"指定Windowが現れた時"のウィンドウを返せるようにした
　GETSLCTLST関数にてリストビュー時にカラム指定をできるようにした
　ログのデフォルト最大行を200行から2000行にした

[Ver4.6b]
　PowerShellを呼び出す POWERSHELL関数を付けた
　FOPEN関数にて既存のUTF16のファイルに読み書き指定をした場合にNGだったのを修正
　CHKIMG関数にて複数取得時の値が x1,y1からの相対座標になっていたのを修正
　SENDSTR関数の追加モードにて文字数が多いとオーバーフローを起こす事があるのを修正
　STATUS関数のST_BUSYの処理方法を変更した（一部の状況でしか有効でなかった為）
　ログ表示のフォントをプロポーショナルから等幅に変更した

=======================================================================
[その他]
・ご使用条件
　本ソフトウェアを逆アセンブル、逆コンパイル、リバースエンジニアすることは禁止です。
　その他、法律、規則等により禁止されている事項での使用は禁止です。

・商用利用、配布について
　　商用利用は自己責任において可です。
　　二次配布(スクリプトにFree版のUWSC.EXEを同封)するような事はご遠慮下さい。
　　この場合は、シェアウェア版のUWSC ProにてEXE化したものを配布するか
　　当サイトからFree版をダウンロードしてもらうようお願い致します。

・免責事項
　本ソフトウェアをご使用になった上で生じた損害に対して、著作権者は一切の責任を負いません。
　著作権者は保守、デバック、バージョンアップ等の義務を負う事はありません。

・Web
　　http://www.uwsc.info/

・バグ報告、質問等は掲示板へ

・e-mail (使用時は半角に)
　　ｕｗｓｃ＠ｕｗｓｃ．ｉｎｆｏ

